disk91/stm32-it-sdk/Src/stm32l_sdk/gpio_wrapper.c
/* ==========================================================
 * uart_wrapper.c - wrapper function for uarts
 * Project : Disk91 SDK
 * ----------------------------------------------------------
 * Created on: 12 sept. 2018
 *     Author: Paul Pinault aka Disk91
 * ----------------------------------------------------------
 * Copyright (C) 2018 Disk91
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU LESSER General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Lesser Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 * ----------------------------------------------------------
 * Serial1 is LPUART
 * Serial2 is USART2
 * Debuh is non affected
 *
 * ==========================================================
 */
#include <string.h>
#include <stdbool.h>
#include <it_sdk/config.h>
#if ITSDK_PLATFORM == __PLATFORM_STM32L0 || ITSDK_PLATFORM == __PLATFORM_STM32L4 || ITSDK_PLATFORM == __PLATFORM_STM32WLE

#include <it_sdk/itsdk.h>
#include <it_sdk/wrappers.h>
#include <it_sdk/logger/error.h>
#include <it_sdk/logger/logger.h>
#if ITSDK_PLATFORM == __PLATFORM_STM32L0
	#include "stm32l0xx_hal.h"
#elif ITSDK_PLATFORM == __PLATFORM_STM32L4
	#include "stm32l4xx_hal.h"
#elif ITSDK_PLATFORM == __PLATFORM_STM32WLE
	#include "stm32wlxx_hal.h"
#endif

#if ITSDK_WITH_PWM == __ENABLE
	#include "tim.h"
#endif

#ifndef ITSDK_DEVICE
#error ITSDK_DEVICE is not defined
#endif

/**
 * Convert the bankId used as a generic Id to the right GPIO structure
 */
GPIO_TypeDef * getPortFromBankId(uint8_t bankId) {
	switch ( bankId ) {
	case __BANK_A: return GPIOA;
	case __BANK_B: return GPIOB;
	case __BANK_C: return GPIOC;
#if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L053R8 || ITSDK_DEVICE == __DEVICE_STM32L476RG
	case __BANK_D: return GPIOD;
#endif
#if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L476RG
	case __BANK_E: return GPIOE;
#endif
#if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L082XX || ITSDK_DEVICE == __DEVICE_STM32WLE5JC || ITSDK_DEVICE == __DEVICE_STM32L476RG
	case __BANK_H: return GPIOH;
#endif
#if ITSDK_DEVICE == __DEVICE_STM32L476RG
	case __BANK_F: return GPIOF;
	case __BANK_G: return GPIOG;
#endif
	default:
		ITSDK_ERROR_REPORT(ITSDK_ERROR_GPIO_UNSUPPORTED_BANK,(uint16_t)bankId);
	}
	return NULL;
}

/**
 * Convert the pin vector (every pin is corresponding to a single bit) to a pin number.
 * Internal
 */
uint8_t getPinNumFromPinVector(uint16_t pinId) {
	uint8_t pinPos=0;
	if ( ( pinId & 0xFF00 ) != 0) { pinPos |= 0x8; }
	if ( ( pinId & 0xF0F0 ) != 0) { pinPos |= 0x4; }
	if ( ( pinId & 0xCCCC ) != 0) { pinPos |= 0x2; }
	if ( ( pinId & 0xAAAA ) != 0) { pinPos |= 0x1; }
	return pinPos;
}

/**
 * Convert a GPIO bank/pin into the corresponding ExtI line
 */
IRQn_Type getIrqFromBankPin(uint8_t bankId, uint16_t id) {

	uint8_t pinPos = getPinNumFromPinVector(id);
	#if ITSDK_PLATFORM == __PLATFORM_STM32L0
		if ( pinPos <= 1 ) {
			return EXTI0_1_IRQn;
		} else if ( pinPos <= 3 ) {
			return EXTI2_3_IRQn;
		} else {
			return EXTI4_15_IRQn;
		}
	#elif ITSDK_PLATFORM == __PLATFORM_STM32WLE ||  ITSDK_PLATFORM == __PLATFORM_STM32L4
		if ( pinPos == 0 ) {
			return EXTI0_IRQn;
		} else if ( pinPos == 1 ) {
			return EXTI1_IRQn;
		} else if ( pinPos == 2 ) {
			return EXTI2_IRQn;
		} else if ( pinPos == 3 ) {
			return EXTI3_IRQn;
		} else if ( pinPos == 4 ) {
			return EXTI4_IRQn;
		} else if ( pinPos <= 9 ) {
			return EXTI9_5_IRQn;
		} else {
			return EXTI15_10_IRQn;
		}
	#endif
}


void gpio_configure(uint8_t bank, uint16_t id, itsdk_gpio_type_t type ) {
	gpio_configure_ext(bank, id, type, ITSDK_GPIO_SPEED_LOW, ITSDK_GPIO_ALT_NONE );
}


void gpio_configure_ext(uint8_t bank, uint16_t id, itsdk_gpio_type_t type, itsdk_gpio_speed_t speed, itsdk_gpio_alternate_t alternate ) {

	GPIO_InitTypeDef GPIO_InitStruct;

	switch ( bank ) {
	case __BANK_A:
		  __GPIOA_CLK_ENABLE();
		  break;
	case __BANK_B:
		  __GPIOB_CLK_ENABLE();
		  break;
	case __BANK_C:
		  __GPIOC_CLK_ENABLE();
		  break;
    #if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L053R8 || ITSDK_DEVICE == __DEVICE_STM32L476RG
	case __BANK_D:
		  __GPIOD_CLK_ENABLE();
		  break;
	#endif
	#if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L476RG
	case __BANK_E:
		  __GPIOE_CLK_ENABLE();
		  break;
  	#endif
	#if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L082XX || ITSDK_DEVICE == __DEVICE_STM32WLE5JC || ITSDK_DEVICE == __DEVICE_STM32L476RG
	case __BANK_H:
		  __GPIOH_CLK_ENABLE();
		  break;
	#endif
	#if ITSDK_DEVICE == __DEVICE_STM32L476RG
	case __BANK_F:
		__GPIOF_CLK_ENABLE();
		break;
	case __BANK_G:
		__GPIOG_CLK_ENABLE();
		break;
	#endif
	}

	GPIO_InitStruct.Pin = id;
	switch ( speed ) {
	default:
	case ITSDK_GPIO_SPEED_LOW:
		GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
		break;
	case ITSDK_GPIO_SPEED_HIGH:
		GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
		break;

	}

	switch (type) {

	case GPIO_OUTPUT_PP:
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		break;

	case GPIO_OUTPUT_PULLUP:
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStruct.Pull = GPIO_PULLUP;
		break;

	case GPIO_OUTPUT_PULLDOWN:
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStruct.Pull = GPIO_PULLDOWN;
		break;

	case GPIO_OUTPUT_OD:
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		break;

	case GPIO_OUTPUT_OD_PULLUP:
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
		GPIO_InitStruct.Pull = GPIO_PULLUP;
		break;

