disk91/stm32-it-sdk/Src/stm32l_sdk/gpio_wrapper.c
	case GPIO_OUTPUT_OD_PULLDOWN:
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
		GPIO_InitStruct.Pull = GPIO_PULLDOWN;
		break;

	case GPIO_INPUT:
		GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		break;

	case GPIO_INPUT_PULLUP:
		GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
		GPIO_InitStruct.Pull = GPIO_PULLUP;
		break;

	case GPIO_INPUT_PULLDOWN:
		GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
		GPIO_InitStruct.Pull = GPIO_PULLDOWN;
		break;

	case GPIO_INTERRUPT_RISING:
	    GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
	    GPIO_InitStruct.Pull = GPIO_NOPULL;
		break;

	case GPIO_INTERRUPT_RISING_PULLDWN:
	    GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
	    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
		break;

	case GPIO_INTERRUPT_RISING_PULLUP:
	    GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
	    GPIO_InitStruct.Pull = GPIO_PULLUP;
		break;

	case GPIO_INTERRUPT_FALLING:
	    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
	    GPIO_InitStruct.Pull = GPIO_NOPULL;
		break;

	case GPIO_INTERRUPT_FALLING_PULLUP:
	    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
	    GPIO_InitStruct.Pull = GPIO_PULLUP;
		break;

	case GPIO_INTERRUPT_FALLING_PULLDWN:
	    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
	    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
		break;

	case GPIO_INTERRUPT_ANY:
	    GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
	    GPIO_InitStruct.Pull = GPIO_NOPULL;
		break;

	case GPIO_ANALOG:
	    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
	    GPIO_InitStruct.Pull = GPIO_NOPULL;
		break;

	case GPIO_OFF:
	    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
	    GPIO_InitStruct.Pull = GPIO_NOPULL;
		break;

	case GPIO_ALTERNATE_PP_NOPULL:
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	    GPIO_InitStruct.Pull = GPIO_NOPULL;
	    break;

	case GPIO_ALTERNATE_PP_PULLUP:
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	    GPIO_InitStruct.Pull = GPIO_PULLUP;
	    break;

	case GPIO_ALTERNATE_PP_PULLDOWN:
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
	    break;

	case GPIO_ALTERNATE_OPENDRAIN:
		GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
	    GPIO_InitStruct.Pull = GPIO_NOPULL;
	    break;

	case GPIO_ALTERNATE_TIMER:
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	    GPIO_InitStruct.Pull = GPIO_NOPULL;
	    break;

	}
	int err=0;
	switch (type) {
	case GPIO_ALTERNATE_PP_NOPULL:
	case GPIO_ALTERNATE_PP_PULLUP:
	case GPIO_ALTERNATE_PP_PULLDOWN:
	case GPIO_ALTERNATE_OPENDRAIN:
	case GPIO_ALTERNATE_TIMER:
		switch (alternate) {
		case ITSDK_GPIO_ALT_TIMER2_TR:
		#if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L082XX || ITSDK_DEVICE == __DEVICE_STM32L052T8
			if ( bank == __BANK_A && id == __LP_GPIO_15 ) GPIO_InitStruct.Alternate = GPIO_AF2_TIM2;
			else if ( bank == __BANK_A && id == __LP_GPIO_5 ) GPIO_InitStruct.Alternate = GPIO_AF2_TIM2;
			else if ( bank == __BANK_A && id == __LP_GPIO_0 ) GPIO_InitStruct.Alternate = GPIO_AF5_TIM2;
			else err=1;
		#else
		  #warning This device will not accept alternate GPIO configuration: code is missing
		#endif
			break;
		case ITSDK_GPIO_ALT_TIMER2_C1:
		#if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L082XX || ITSDK_DEVICE == __DEVICE_STM32L052T8
			if ( bank == __BANK_A && id == __LP_GPIO_15 ) GPIO_InitStruct.Alternate = GPIO_AF5_TIM2;
			else if ( bank == __BANK_A && id == __LP_GPIO_5 ) GPIO_InitStruct.Alternate = GPIO_AF5_TIM2;
			else if ( bank == __BANK_A && id == __LP_GPIO_0 ) GPIO_InitStruct.Alternate = GPIO_AF2_TIM2;
			else err=1;
		#elif ITSDK_DEVICE == __DEVICE_STM32L476RG
			if ( bank == __BANK_A && id == __LP_GPIO_0 ) GPIO_InitStruct.Alternate = GPIO_AF1_TIM2;
			else if ( bank == __BANK_A && id == __LP_GPIO_5 ) GPIO_InitStruct.Alternate = GPIO_AF1_TIM2;
			else if ( bank == __BANK_A && id == __LP_GPIO_15 ) GPIO_InitStruct.Alternate = GPIO_AF1_TIM2;
			else err=1;
		#endif
			break;
		case ITSDK_GPIO_ALT_TIMER3_C1:
		#if ITSDK_DEVICE == __DEVICE_STM32L476RG
			if ( bank == __BANK_A && id == __LP_GPIO_6 ) GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
			else if ( bank == __BANK_B && id == __LP_GPIO_4 ) GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
			else if ( bank == __BANK_C && id == __LP_GPIO_6 ) GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
			else err=1;
		#elif
			err=1;
		#endif
			break;
		case ITSDK_GPIO_ALT_TIMER3_C2:
		#if ITSDK_DEVICE == __DEVICE_STM32L476RG
			if ( bank == __BANK_A && id == __LP_GPIO_7 ) GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
			else if ( bank == __BANK_B && id == __LP_GPIO_5 ) GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
			else if ( bank == __BANK_C && id == __LP_GPIO_7 ) GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
			else err=1;
		#elif
			err=1;
		#endif
			break;
		case ITSDK_GPIO_ALT_TIMER3_C3:
		#if ITSDK_DEVICE == __DEVICE_STM32L476RG
			if ( bank == __BANK_B && id == __LP_GPIO_0 ) GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
			else if ( bank == __BANK_C && id == __LP_GPIO_8 ) GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
			else err=1;
		#elif
			err=1;
		#endif
			break;
		case ITSDK_GPIO_ALT_TIMER3_C4:
		#if ITSDK_DEVICE == __DEVICE_STM32L476RG
			if ( bank == __BANK_B && id == __LP_GPIO_1 ) GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
			else if ( bank == __BANK_C && id == __LP_GPIO_9 ) GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
			else err=1;
		#elif
			err=1;
		#endif
			break;
#if ITSDK_WITH_SPI	== __SPI_ENABLED
		case ITSDK_GPIO_ALT_SPI1_SCLK:
			#if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L082XX
				if ( bank == __BANK_A && id == __LP_GPIO_5 ) GPIO_InitStruct.Alternate = GPIO_AF0_SPI1;
				else err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L052T8
				if ( bank == __BANK_A && id == __LP_GPIO_5 ) GPIO_InitStruct.Alternate = GPIO_AF0_SPI1;
				else if ( bank == __BANK_B && id == __LP_GPIO_3 ) GPIO_InitStruct.Alternate = GPIO_AF0_SPI1;
				else err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L476RG
				if ( bank == __BANK_B && id == __LP_GPIO_3 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_A && id == __LP_GPIO_5 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_E && id == __LP_GPIO_13 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_G && id == __LP_GPIO_2 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else err=1;
			#endif
			break;
		case ITSDK_GPIO_ALT_SPI1_MOSI:
			#if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L082XX
				if ( bank == __BANK_B && id == __LP_GPIO_5 ) GPIO_InitStruct.Alternate = GPIO_AF0_SPI1;
				else err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L052T8
				if ( bank == __BANK_A && id == __LP_GPIO_7 ) GPIO_InitStruct.Alternate = GPIO_AF0_SPI1;
				else if ( bank == __BANK_A && id == __LP_GPIO_12 ) GPIO_InitStruct.Alternate = GPIO_AF0_SPI1;
				else if ( bank == __BANK_B && id == __LP_GPIO_5 ) GPIO_InitStruct.Alternate = GPIO_AF0_SPI1;
				else err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L476RG
				if ( bank == __BANK_B && id == __LP_GPIO_5 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_A && id == __LP_GPIO_7 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_E && id == __LP_GPIO_15 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_G && id == __LP_GPIO_4 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else err=1;
			#endif
			break;
		case ITSDK_GPIO_ALT_SPI1_MISO:
			#if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L082XX
				err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L052T8
				if ( bank == __BANK_A && id == __LP_GPIO_11 ) GPIO_InitStruct.Alternate = GPIO_AF0_SPI1;
				else if( bank == __BANK_A && id == __LP_GPIO_6 ) GPIO_InitStruct.Alternate = GPIO_AF0_SPI1;
				else if( bank == __BANK_B && id == __LP_GPIO_4 ) GPIO_InitStruct.Alternate = GPIO_AF0_SPI1;
				else err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L476RG
				if ( bank == __BANK_B && id == __LP_GPIO_4 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_A && id == __LP_GPIO_6 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_E && id == __LP_GPIO_14 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_G && id == __LP_GPIO_3 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else err=1;
			#endif
			break;
		case ITSDK_GPIO_ALT_SPI1_NSS:
			#if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L082XX
				err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L052T8
				if ( bank == __BANK_A && id == __LP_GPIO_4 ) GPIO_InitStruct.Alternate = GPIO_AF0_SPI1;
				else if( bank == __BANK_A && id == __LP_GPIO_15 ) GPIO_InitStruct.Alternate = GPIO_AF0_SPI1;
				else err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L476RG
				if ( bank == __BANK_A && id == __LP_GPIO_15 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_A && id == __LP_GPIO_4 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_E && id == __LP_GPIO_12 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_G && id == __LP_GPIO_5 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else err=1;
			#endif
			break;
		case ITSDK_GPIO_ALT_SPI2_SCLK:
			#if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L082XX
				err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L052T8
				err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L476RG
				if ( bank == __BANK_B && id == __LP_GPIO_10 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_B && id == __LP_GPIO_13 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_D && id == __LP_GPIO_1 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else err=1;
			#endif
			break;
		case ITSDK_GPIO_ALT_SPI2_NSS:
			#if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L082XX
				err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L052T8
				err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L476RG
				if ( bank == __BANK_B && id == __LP_GPIO_9 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_B && id == __LP_GPIO_12 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_D && id == __LP_GPIO_0 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else err=1;
			#endif
			break;
		case ITSDK_GPIO_ALT_SPI2_MOSI:
			#if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L082XX
				err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L052T8
				err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L476RG
				if ( bank == __BANK_B && id == __LP_GPIO_15 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_C && id == __LP_GPIO_3 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_D && id == __LP_GPIO_4 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else err=1;
			#endif
			break;
		case ITSDK_GPIO_ALT_SPI2_MISO:
			#if ITSDK_DEVICE == __DEVICE_STM32L072XX || ITSDK_DEVICE == __DEVICE_STM32L082XX
				err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L052T8
				err=1;
			#elif ITSDK_DEVICE == __DEVICE_STM32L476RG
				if ( bank == __BANK_B && id == __LP_GPIO_14 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_C && id == __LP_GPIO_2 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else if ( bank == __BANK_D && id == __LP_GPIO_3 ) GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
				else err=1;
			#endif
			break;
#endif // WITH_SPI
		default:
		case ITSDK_GPIO_ALT_NONE:
			break;
		}
		if (err>0) {
			log_error("Gpio - invalid alternate\r\n");
		}
		break;
	default:
		break;
	}


