disk91/stm32-it-sdk/Src/stm32l_sdk/gpio_wrapper.c
	HAL_GPIO_Init(getPortFromBankId(bank), &GPIO_InitStruct);

}

void gpio_set(uint8_t bank, uint16_t id) {
	HAL_GPIO_WritePin(getPortFromBankId(bank), id,GPIO_PIN_SET);
}

void gpio_reset(uint8_t bank, uint16_t id) {
	HAL_GPIO_WritePin(getPortFromBankId(bank), id,GPIO_PIN_RESET);
}

void gpio_change(uint8_t bank, uint16_t id, uint8_t val) {
	HAL_GPIO_WritePin(getPortFromBankId(bank), id, ((val==__GPIO_VAL_SET)?GPIO_PIN_SET:GPIO_PIN_RESET));
}

void gpio_toggle(uint8_t bank, uint16_t id) {
	HAL_GPIO_TogglePin(getPortFromBankId(bank), id);
}

uint8_t gpio_read(uint8_t bank, uint16_t id) {
	return HAL_GPIO_ReadPin(getPortFromBankId(bank), id);
}


void gpio_interruptEnable(uint8_t bank, uint16_t id) {
	HAL_NVIC_EnableIRQ(getIrqFromBankPin(bank,id));
}

void gpio_interruptDisable(uint8_t bank, uint16_t id) {
	HAL_NVIC_DisableIRQ(getIrqFromBankPin(bank,id));
}

void gpio_interruptDisableAll() {
	#if ITSDK_PLATFORM == __PLATFORM_STM32L0
	  HAL_NVIC_DisableIRQ(EXTI0_1_IRQn);
	  HAL_NVIC_DisableIRQ(EXTI4_15_IRQn);
	#elif ITSDK_PLATFORM == __PLATFORM_STM32WLE || ITSDK_PLATFORM == __PLATFORM_STM32L4
	  HAL_NVIC_DisableIRQ(EXTI0_IRQn);
	  HAL_NVIC_DisableIRQ(EXTI1_IRQn);
	  HAL_NVIC_DisableIRQ(EXTI2_IRQn);
	  HAL_NVIC_DisableIRQ(EXTI3_IRQn);
	  HAL_NVIC_DisableIRQ(EXTI4_IRQn);
	  HAL_NVIC_DisableIRQ(EXTI9_5_IRQn);
	  HAL_NVIC_DisableIRQ(EXTI15_10_IRQn);
	#endif
}

void gpio_interruptPriority(uint8_t bank, uint16_t id, uint8_t nPreemption, uint8_t nSubpriority) {
	HAL_NVIC_SetPriority(getIrqFromBankPin(bank,id), nPreemption, nSubpriority);
}

void gpio_interruptClear(uint8_t bank, uint16_t id) {
	__HAL_GPIO_EXTI_CLEAR_IT(id);
}


/**
 * RCT Interrupt handler allowing to chain different function
 * The callback function will be fired when pinMask is matching or
 * equal to 0.
 */
gpio_irq_chain_t __gpio_irq_chain = { NULL, 0, NULL };
gpio_irq_chain_t * __gpio_irq_wakeup = NULL;
#if !defined ITSDK_WITH_GPIO_HANDLER || ITSDK_WITH_GPIO_HANDLER == __ENABLE
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
#else
void gpio_Callback(uint16_t GPIO_Pin)
#endif
{

	// When the __gpio_irq_wakeup handler is set this handler is called
	// Because we do not want the normal handler to be called until the
	// MCU is correctly configured when waking up from deep-sleep
	if (__gpio_irq_wakeup != NULL ) {
		void (*p)(uint16_t p) = __gpio_irq_wakeup->irq_func;
		if ( p != NULL ) {
			p(GPIO_Pin);
			return;
		}
	}
	// Normal non wake-up situation.
	gpio_irq_chain_t * c = &__gpio_irq_chain;
	while ( c != NULL ) {
		void (*p)(uint16_t p) = c->irq_func;
		if ( p != NULL && (c->pinMask==0 || ((c->pinMask & GPIO_Pin) > 0) ) ) {
			p(GPIO_Pin);
		}
		c = c->next;
	}
	#if !defined ITSDK_WITH_GPIO_HANDLER || ITSDK_WITH_GPIO_HANDLER == __ENABLE
    __HAL_GPIO_EXTI_CLEAR_IT(GPIO_Pin);
	#endif
}

/**
 * Add an action on wake-up.
 * This action replace temporaly the exiting actions
 */
void gpio_registerWakeUpAction(gpio_irq_chain_t * chain) {
	__gpio_irq_wakeup = chain;
}

/**
 * Remove the action on wake-up.
 * This action restore the previously defined gpio actions
 */
void gpio_removeWakeUpAction() {
	__gpio_irq_wakeup = NULL;
}

/**
 * Add an action to the chain, the action **must be** static
 */
void gpio_registerIrqAction(gpio_irq_chain_t * chain) {
	gpio_irq_chain_t * c = &__gpio_irq_chain;
	while ( c->next != NULL && c->irq_func != chain->irq_func ) {
	  c = c->next;
	}
	if ( c->irq_func != chain->irq_func ) {
		// the Action is not already existing
		c->next=chain;
		chain->next = NULL;
	}
}

/**
 * Remove an action to the chain, the action **must be** static
 */
void gpio_removeIrqAction(gpio_irq_chain_t * chain) {
	gpio_irq_chain_t * c = &__gpio_irq_chain;
	while ( c != NULL && c->next != chain ) {
	  c = c->next;
	}
	if ( c != NULL ) {
		c->next = c->next->next;
	}
}

/**
 * Search for an existing action
 */
bool gpio_existAction(gpio_irq_chain_t * chain) {
	gpio_irq_chain_t * c = &__gpio_irq_chain;
	while ( c != NULL && c->next != chain ) {
	  c = c->next;
	}
	if ( c != NULL ) {
		return true;
	}
	return false;
}


// ==============================================================
// PWM FUNCTIONS
// ==============================================================

#if defined ITSDK_WITH_PWM && ITSDK_WITH_PWM == __ENABLE

#define __PWM_INVALID	0xFFFFFFFF
struct __pwm_channel_s {
	uint32_t channel;
	TIM_HandleTypeDef * handler;

};

struct __pwm_channel_s __pwm_getChannelFromBankAndPin(uint8_t bank, uint16_t pin) {

	struct __pwm_channel_s ret;
	ret.channel = __PWM_INVALID;

#if ITSDK_DEVICE == __DEVICE_STM32L476RG

	switch ( bank ) {
	case __BANK_A:
		#if ITSDK_WITH_PWM_TIMER == __TIMER_2
		ret.handler = &htim2;
		switch (pin) {
		case __LP_GPIO_0:
			ret.channel = TIM_CHANNEL_1;
			break;
		case __LP_GPIO_1:
			ret.channel = TIM_CHANNEL_2;
			break;
		case __LP_GPIO_2:
			ret.channel = TIM_CHANNEL_3;
			break;
		case __LP_GPIO_3:
			ret.channel = TIM_CHANNEL_4;
			break;
		case __LP_GPIO_15:
			ret.channel = TIM_CHANNEL_1;
			break;
		default:
			break;
		}
		#elif ITSDK_WITH_PWM_TIMER == __TIMER_1
		ret.handler = &htim1;
		switch (pin) {
		case __LP_GPIO_8:
			ret.channel = TIM_CHANNEL_1;
			break;
		case __LP_GPIO_9:
			ret.channel = TIM_CHANNEL_2;
			break;
		case __LP_GPIO_10:
			ret.channel = TIM_CHANNEL_3;
			break;
		case __LP_GPIO_11:
			ret.channel = TIM_CHANNEL_4;
			break;
		default:
			break;
		}
		#elif ITSDK_WITH_PWM_TIMER == __TIMER_5
		ret.handler = &htim5;
		switch (pin) {
		case __LP_GPIO_0:
			ret.channel = TIM_CHANNEL_1;
			break;
		case __LP_GPIO_1:
			ret.channel = TIM_CHANNEL_2;
			break;
		case __LP_GPIO_2:
			ret.channel = TIM_CHANNEL_3;
			break;
		case __LP_GPIO_3:
			ret.channel = TIM_CHANNEL_4;
			break;
		default:
			break;
		}
		#elif ITSDK_WITH_PWM_TIMER == __TIMER_3
		ret.handler = &htim3;
		switch (pin) {
		case __LP_GPIO_6:
			ret.channel = TIM_CHANNEL_1;
			break;
		case __LP_GPIO_7:
			ret.channel = TIM_CHANNEL_2;
			break;
		default:
			break;
		}

		#elif ITSDK_WITH_PWM_TIMER == __TIMER_8
		ret.handler = &htim8;
		switch (pin) {
		case __LP_GPIO_5:
			ret.channel = TIM_CHANNEL_1;
			break;
		default:
			break;
		}

		#endif

		break;
	case __BANK_B:
		#if ITSDK_WITH_PWM_TIMER == __TIMER_3
		ret.handler = &htim3;
		switch (pin) {
		case __LP_GPIO_0:
			ret.channel = TIM_CHANNEL_3;
			break;
		case __LP_GPIO_1:
			ret.channel = TIM_CHANNEL_4;
			break;
		case __LP_GPIO_4:
			ret.channel = TIM_CHANNEL_1;
			break;
		case __LP_GPIO_5:
			ret.channel = TIM_CHANNEL_2;
			break;
		default:
			break;
		}
		#elif ITSDK_WITH_PWM_TIMER == __TIMER_2
		ret.handler = &htim2;
		switch (pin) {
		case __LP_GPIO_3:
			ret.channel = TIM_CHANNEL_2;
			break;
		case __LP_GPIO_10:
			ret.channel = TIM_CHANNEL_3;
			break;
		case __LP_GPIO_11:
			ret.channel = TIM_CHANNEL_4;
			break;
		default:
			break;
		}
		#elif ITSDK_WITH_PWM_TIMER == __TIMER_4
		ret.handler = &htim4;
		switch (pin) {
		case __LP_GPIO_6:
			ret.channel = TIM_CHANNEL_1;
			break;
		case __LP_GPIO_7:
			ret.channel = TIM_CHANNEL_2;
			break;
		case __LP_GPIO_8:
			ret.channel = TIM_CHANNEL_3;
			break;
		case __LP_GPIO_9:
			ret.channel = TIM_CHANNEL_4;
			break;
		default:
			break;
		}
		#endif
		break;
	case __BANK_C:
		#if ITSDK_WITH_PWM_TIMER == __TIMER_3
		ret.handler = &htim3;
		switch (pin) {
		case __LP_GPIO_6:
			ret.channel = TIM_CHANNEL_1;
			break;
		case __LP_GPIO_7:
			ret.channel = TIM_CHANNEL_2;
			break;
		case __LP_GPIO_8:
			ret.channel = TIM_CHANNEL_3;
			break;
		case __LP_GPIO_9:
			ret.channel = TIM_CHANNEL_4;
			break;
		default:
			break;
		}
		#elif ITSDK_WITH_PWM_TIMER == __TIMER_8
		ret.handler = &htim8;
		switch (pin) {
		case __LP_GPIO_6:
			ret.channel = TIM_CHANNEL_1;
			break;
		case __LP_GPIO_7:
			ret.channel = TIM_CHANNEL_2;
			break;
		case __LP_GPIO_8:
			ret.channel = TIM_CHANNEL_3;
			break;
		case __LP_GPIO_9:
			ret.channel = TIM_CHANNEL_4;
			break;
		default:
			break;
		}
		#endif
		break;
	default:
		break;
	}
	return ret;

#else
	#error "Unsupported PWM target, pwm matching need to be defined"
#endif
}


// Init PWM engine base on pin used
void pwm_init(uint8_t bank, uint16_t id) {
	struct __pwm_channel_s config = __pwm_getChannelFromBankAndPin(bank,id);
	if ( config.channel != __PWM_INVALID ) {
		HAL_TIM_PWM_Start(config.handler, config.channel);
	} else {
		log_error("Pwm - invalid channel\r\n");
	}
}

// Set the PWM to a given value in percent of the maximum
void pwm_setPercent(uint8_t bank, uint16_t id, uint8_t value) {
	pwm_set(bank,id,(0xFFFFFFFF/100)*value);
}

// Set the PWM to a given 32b value for max precision scale, adapt to the timer capability
void pwm_set(uint8_t bank, uint16_t id, uint32_t value) {
	struct __pwm_channel_s config = __pwm_getChannelFromBankAndPin(bank,id);
	if ( config.channel != __PWM_INVALID ) {
		value = value >> 16; // CCR1 is 16b register
		switch (config.channel) {
		case TIM_CHANNEL_1:
			config.handler->Instance->CCR1 = value;
			break;
		case TIM_CHANNEL_2:
			config.handler->Instance->CCR2 = value;
			break;
		case TIM_CHANNEL_3:
			config.handler->Instance->CCR3 = value;
			break;
		case TIM_CHANNEL_4:
			config.handler->Instance->CCR4 = value;
			break;
		}
	} else {
		log_error("Pwm - invalid channel\r\n");
	}
}

// Stop the PWM engine
void pwm_deinit(uint8_t bank, uint16_t id) {
	struct __pwm_channel_s config = __pwm_getChannelFromBankAndPin(bank,id);
	if ( config.channel != __PWM_INVALID ) {
		HAL_TIM_PWM_Stop(config.handler, config.channel);
	} else {
		log_error("Pwm - invalid channel\r\n");
	}
}

#endif // ITSDK_WITH_PWM_TIMER

#endif
